using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

using Android.App;
using Android.Content;
using Android.OS;
using Android.Runtime;
using Android.Views;
using Android.Widget;
using JorjeiaAndroidApp.Resources.DataHelper;
using JorjeiaAndroidApp.Resources.Model;
using Android.Graphics;

namespace JorjeiaAndroidApp
{
    [Activity(Label = "ScheduleActivity", Theme = "@style/Theme.AppCompat.Light.NoActionBar")]
    public class ScheduleActivity : Activity
    {
        DataBase db = new DataBase();
        private List<Mission> lstSource;
        private Mission mission;
        private string text;
        private Button newMission;
        private TextView textView;
        protected override void OnCreate(Bundle savedInstanceState)
        {
            base.OnCreate(savedInstanceState);
            SetContentView(Resource.Layout.ScheduleView);
            LoadData();
            SetText();
            FindViews();
            HandleEvents();
            // Create your application here
        }

        private void SetText()
        {
            int water = mission.waterInMl;
            switch (mission.typeMission)
            {
                case 1:
                    text = "Здравейте!Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постигане на оптимални резултати.Нанасяйте „Мисия 1“  три пъти на ден на чиста кожа, която е задължително овлажнена, масажирайте до пълна абсорбация.Минималният препоръчителен период за терапията е 60 дни!Сухата кожа е епидермално жадна и продукта ще попие бързо, заради високото съдържание на вода в него, а с хидратацията ще успеете да оставите маслата на „Мисия 1“ да помогнат на проблемната кожа да се възстановява. Горещо препоръчваме за по -добро овлажняване да ползвате „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 2:
                    text = "Здравейте!Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постиганена оптимални резултати.Нанасяте „Мисия 1“  два пъти на ден-сутрин и вечер, на чиста кожа, която е задължително овлажнена и масажирате до пълна абсорбация. Минималният препоръчителен период за терапията е 90 дни!Сухата кожа е епидермално жадна и продукта ще попие бързо, заради високото съдържание на вода в него, а с хидратацията ще успеете да оставите маслата на „Мисия 1“  да помогнат на проблемната кожа да регенерира.Горещо препоръчваме за хидратацията да ползвате „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 3:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постиганена оптимални резултати.Нанасяте „Мисия 1“  три пъти на ден-сутрин, обед и вечер, на чиста кожа , която е задължително овлажнена и масажирате до пълна абсорбация.Минималният препоръчителен период за терапията е 90 дни!Сухата кожа е епидермално жадна и продукта ще попие бързо, заради високото съдържание на вода в него, а с хидратацията ще успеете да оставите маслата на „Мисия 1“  да помогнат на проблемната кожа да регенерира.Горещо препоръчваме за хидратацията да ползвате „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 4:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постигане на оптимални резултати. Нанасяйте „Мисия 1“  три пъти на ден на чиста кожа, която е задължително овлажнена, масажирайте до пълна абсорбация. Минималният препоръчителен период за терапията е 90 дни!Сухата кожа е епидермално жадна и продукта ще попие бързо, заради високото съдържание на вода в него, а с хидратацията ще успеете да оставите маслата на „Мисия 1“ да помогнат на проблемната кожа да се възстановява. Горещо препоръчваме за по -добро овлажняване да ползвате „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 5:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постигане на оптимални резултати. Нанасяте „Мисия 1“ два пъти на ден- сутрин и вечер, на чиста кожа до пълното и абсорбиране. Минималният препоръчителен период за терапията е 60 дни! Дори и да сте с нормална кожа, горещо Ви препоръчваме епидермална хидратация с „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 6:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постигане на оптимални резултати. Нанасяте „Мисия 1“ два пъти на ден- сутрин и вечер, на чиста кожа до пълното и абсорбиране. Минималният препоръчителен период за терапията е 90 дни! Дори и да сте с нормална кожа, горещо Ви препоръчваме епидермална хидратация с „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 7:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постигане на оптимални резултати. Нанасяте „Мисия 1“ три пъти на ден на чиста кожа до пълното и абсорбиране. Минималният препоръчителен период за терапията е 90 дни! Дори и да сте с нормална кожа, горещо Ви препоръчваме епидермална хидратация с „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 8:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постигане на оптимални резултати. Нанасяте „Мисия 1“ три пъти на ден на чиста кожа до пълното и абсорбиране. Минималният препоръчителен период за терапията е 90 дни! Дори и да сте с нормална кожа, горещо Ви препоръчваме епидермална хидратация с „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 9:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 2“ за постигане на оптимални резултати.Нанасяте „Мисия 2“  два пъти на ден-сутрин и вечер, на чиста кожа, която е задължително овлажнена и масажирате до пълна абсорбация. Минималният препоръчителен период за терапията е 60 дни!Сухата кожа е епидермално жадна и продукта ще попие бързо, заради високото съдържание на вода в него, а с хидратацията ще успеете да оставите маслата на „Мисия 2“  да помогнат на проблемната кожа да регенерира.Горещо препоръчваме за хидратацията да ползвате „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 2“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 10:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 2“ за постигане на оптимални резултати.Нанасяте „Мисия 2“  три пъти на ден-сутрин, обед и вечер, на чиста кожа , която е задължително овлажнена и масажирате до пълна абсорбация.Минималният препоръчителен период за терапията е 90 дни!Сухата кожа е епидермално жадна и продукта ще попие бързо, заради високото съдържание на вода в него, а с хидратацията ще успеете да оставите маслата на „Мисия 2“  да помогнат на проблемната кожа да регенерира.Горещо препоръчваме за хидратацията да ползвате „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 2“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 11:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 2“ за постигане на оптимални резултати. Нанасяте „Мисия 2“ два пъти на ден- сутрин и вечер, на чиста кожа до пълното и абсорбиране. Минималният препоръчителен период за терапията е 60 дни! Дори и да сте с нормална кожа, горещо Ви препоръчваме епидермална хидратация с „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 2“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 12:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 2“ за постигане на оптимални резултати. Нанасяте „Мисия 2“ три пъти на ден- сутрин, обед и вечер, на чиста кожа до пълното и абсорбиране. Минималният препоръчителен период за терапията е 90 дни! Дори и да сте с нормална кожа, горещо Ви препоръчваме епидермална хидратация с „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 2“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 13:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продуктите „Мисия 1“ и „Мисия 2“ за постигане на оптимални резултати. Ако двата участъка, които третирате съвпадат, първо нанесете „Мисия 1“ и след две минути нанесете „Мисия 2“. Правете това  три пъти на ден върху чиста кожа , която е задължително овлажнена. Масажирайте до пълна абсорбация. Минималният препоръчителен период за терапията е 60 дни!Сухата кожа е епидермално жадна и ще попие много бързо гела, а с хидратацията ще успеете да оставите маслата на „Мисия 1“ и „Мисия 2“ да помогнат на проблемната кожа да регенерира.За овлажняването на Вашата кожа горещо препоръчваме да ползвате „Мисия 3 - Боди Коктейл с хиалуронова киселина“, специално създаден за подпомагане на действието на „Мисия1“ и „Мисия 2“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 14:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продуктите „Мисия 1“ и „Мисия 2“ за постигане на оптимални резултати. Ако двата участъка, които третирате съвпадат, първо нанесете „Мисия 1“ и след две минути нанесете „Мисия 2“. Правете това  два пъти на ден, сутрин и вечер, върху  чиста кожа, която е задължително овлажнена.Масажирайте до пълна абсорбация. Минималният препоръчителен период за терапията е 90 дни!Сухата кожа е епидермално жадна и ще попие много бързо гела, а с хидратацията ще успеете да оставите маслата на „Мисия 1“ и „Мисия 2“ да помогнат на проблемната кожа да регенерира.За овлажняването на Вашата кожа горещо препоръчваме да ползвате „Мисия 3 - Боди Коктейл с хиалуронова киселина“, специално създаден за подпомагане на действието на „Мисия1“ и „Мисия 2“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 15:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продуктите „Мисия 1“ и „Мисия 2“ за постигане на оптимални резултати. Ако двата участъка, които третирате съвпадат, първо нанесете „Мисия 1“ и след две минути нанесете „Мисия 2“. Правете това  три пъти на ден върху чиста кожа , която е задължително овлажнена. Масажирайте до пълна абсорбация. Минималният препоръчителен период за терапията е 90 дни!Сухата кожа е епидермално жадна и ще попие много бързо гела, а с хидратацията ще успеете да оставите маслата на „Мисия 1“ и „Мисия 2“ да помогнат на проблемната кожа да регенерира.За овлажняването на Вашата кожа горещо препоръчваме да ползвате „Мисия 3 - Боди Коктейл с хиалуронова киселина“, специално създаден за подпомагане на действието на „Мисия1“ и „Мисия 2“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 16:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продуктите „Мисия 1“ и „Мисия 2“ за постигане на оптимални резултати. Ако двата участъка, които третирате съвпадат, първо нанесете „Мисия 1“ и след две минути нанесете „Мисия 2“. Правете това  три пъти на ден върху чиста кожа , която е задължително овлажнена. Масажирайте до пълна абсорбация. Минималният препоръчителен период за терапията е 90 дни!Сухата кожа е епидермално жадна и ще попие много бързо гела, а с хидратацията ще успеете да оставите маслата на „Мисия 1“ и „Мисия 2“ да помогнат на проблемната кожа да регенерира.За овлажняването на Вашата кожа горещо препоръчваме да ползвате „Мисия 3 - Боди Коктейл с хиалуронова киселина“, специално създаден за подпомагане на действието на „Мисия1“ и „Мисия 2“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 17:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продуктите „Мисия 1“ и „Мисия 2“ за постигане на оптимални резултати. Ако двата участъка, които третирате съвпадат, първо нанесете „Мисия 1“ и след две минути нанесете „Мисия 2“. Правете това  три пъти на ден върху чиста кожа, която е   задължително овлажнена. Масажирайте до пълното абсорбиране. Минималният препоръчителен период за терапията е 60 дни!Дори и да сте с нормална кожа, Ви препоръчваме овлажняване на вашата кожа с „Мисия 3 - Боди Коктейл с хиалуронова киселина“, специално създаден да подпомагана действието на „Мисия 1“ и „Мисия 2“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 18:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продуктите „Мисия 1“ и „Мисия 2“ за постигане на оптимални резултати. Ако двата участъка, които третирате съвпадат, първо нанесете „Мисия 1“ и след две минути нанесете „Мисия 2“. Правете това  два пъти на ден, сутрин и вечер, върху чиста кожа, която е задължително овлажнена.Масажирайте до пълното абсорбиране. Минималният препоръчителен период за терапията е 90 дни!Дори и да сте с нормална кожа, Ви препоръчваме овлажняване на вашата кожа с „Мисия 3 - Боди Коктейл с хиалуронова киселина“, специално създаден да подпомагана действието на „Мисия 1“ и „Мисия 2“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 19:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продуктите „Мисия 1“ и „Мисия 2“ за постигане на оптимални резултати. Ако двата участъка, които третирате съвпадат, първо нанесете „Мисия 1“ и след две минути нанесете „Мисия 2“. Правете това  три пъти на ден върху чиста кожа, която е   задължително овлажнена. Масажирайте до пълното абсорбиране. Минималният препоръчителен период за терапията е 90 дни!Дори и да сте с нормална кожа, Ви препоръчваме овлажняване на вашата кожа с „Мисия 3 - Боди Коктейл с хиалуронова киселина“, специално създаден да подпомагана действието на „Мисия 1“ и „Мисия 2“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 20:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продуктите „Мисия 1“ и „Мисия 2“ за постигане на оптимални резултати. Ако двата участъка, които третирате съвпадат, първо нанесете „Мисия 1“ и след две минути нанесете „Мисия 2“. Правете това  три пъти на ден върху чиста кожа, която е   задължително овлажнена. Масажирайте до пълното абсорбиране. Минималният препоръчителен период за терапията е 90 дни!Дори и да сте с нормална кожа, Ви препоръчваме овлажняване на вашата кожа с „Мисия 3 - Боди Коктейл с хиалуронова киселина“, специално създаден да подпомагана действието на „Мисия 1“ и „Мисия 2“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 21:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘“. Сухата кожа е епидермално жадна и за допълнителна хидратация първо използвайте „Мисия 3“ и пет  минути след това нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да регенерират и помогнат на кожата да се възстанови.  Тази процедура се прилага три пъти на ден-  сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 60 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 22:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘“. Сухата кожа е епидермално жадна и за допълнителна хидратация първо използвайте „Мисия 3“ и пет  минути след това нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да регенерират и помогнат на кожата да се възстанови.  Тази процедура се прилага два пъти на ден-  сутрин и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 23:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘“. Сухата кожа е епидермално жадна и за допълнителна хидратация първо използвайте „Мисия 3“ и пет  минути след това нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да регенерират и помогнат на кожата да се възстанови.  Тази процедура се прилага три пъти на ден-  сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 24:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘“. Сухата кожа е епидермално жадна и за допълнителна хидратация първо използвайте „Мисия 3“ и пет  минути след това нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да регенерират и помогнат на кожата да се възстанови.  Тази процедура се прилага три пъти на ден-  сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 25:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘. Дори и да  сте с нормална кожа, препоръчваме за допълнителна хидратация първо да използвате „Мисия 3“ и след пет минути да  нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да помогнат на кожата да се възстанови.  Тази процедура се прилага три пъти на ден- сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 60 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 26:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘. Дори и да  сте с нормална кожа, препоръчваме за допълнителна хидратация първо да използвате „Мисия 3“ и след пет минути да  нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да помогнат на кожата да се възстанови.  Тази процедура се прилага два пъти на ден- сутрин и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 27:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘. Дори и да  сте с нормална кожа, препоръчваме за допълнителна хидратация първо да използвате „Мисия 3“ и след пет минути да  нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да помогнат на кожата да се възстанови.  Тази процедура се прилага три пъти на ден- сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 28:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘. Дори и да  сте с нормална кожа, препоръчваме за допълнителна хидратация първо да използвате „Мисия 3“ и след пет минути да  нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да помогнат на кожата да се възстанови.  Тази процедура се прилага три пъти на ден- сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 29:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 2“ и „Мисия 3‘“. Сухата кожа е епидермално жадна и за допълнителна хидратация първо използвайте „Мисия 3“ и пет  минути след това нанесете „Мисия 2“.    Така маслата ще се задържат на повърхността и ще успеят да помогнат на кожата да се възстанови.  Тази процедура се прилага два пъти на ден- сутрин и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 60 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 30:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 2“ и „Мисия 3‘“. Сухата кожа е епидермално жадна и за допълнителна хидратация първо използвайте „Мисия 3“ и пет  минути след това нанесете „Мисия 2“.    Така маслата ще се задържат на повърхността и ще успеят да помогнат на кожата да се възстанови.  Тази процедура се прилага три пъти на ден- сутрин, обед  и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 31:
                    text = "Здравейте! Поздравление, че сте избрали оптималните продукти за борба с целулита: „Мисия 2“ и „Мисия 3“. Дори и да сте с с нормална кожа, горещо препоръчваме  за допълнителна хидратация първо да използвате ‚Мисия 3“ и пет минути след това да нанесете „Мисия 2“.  Така маслата ще се задържат на повърхността и ще успеят да помогнат на кожата да се възстанови.  Тази процедура се прилага два пъти на ден- сутрин и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 60 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 32:
                    text = "Здравейте! Поздравление, че сте избрали оптималните продукти за борба с целулита: „Мисия 2“ и „Мисия 3“. Дори и да сте с с нормална кожа, горещо препоръчваме  за допълнителна хидратация първо да използвате ‚Мисия 3“ и пет минути след това да нанесете „Мисия 2“.  Така маслата ще се задържат на повърхността и ще успеят да помогнат на кожата да се възстанови.  Тази процедура се прилага три пъти на ден- сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 33:
                    text = "Здравейте, това е персоналната ни препоръка при ползване на трите Мисии.  Сухата кожа е епидермално жадна и за допълнителна хидратация първо използвайте „Мисия 3“. Ако ще използвате продуктите върху една и съща проблемна зона, схемата на нанасяне  за Вас е следната - първо хидратирайте кожата си с „Мисия 3‘, след пет минути  нанесете  „Мисия 1‘ и непосредствено след това е ред на ‚Мисия 2‘. Тази процедура се прилага два пъти на ден-  сутрин и вечер, най-добре след топъл душ и на чиста кожа. Разбира се това ще изисква търпение, но си заслужава резултата. „Мисия 3“ има за задача да витализира кожата ви и да остави маслата на другите две мисии да работят върху повърхността й. Минималният препоръчителен период за терапията е 60 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 34:
                    text = "Здравейте, това е персоналната ни препоръка при ползване на трите Мисии.  Сухата кожа е епидермално жадна и за допълнителна хидратация първо използвайте „Мисия 3“. Ако ще използвате продуктите върху една и съща проблемна зона, схемата на нанасяне  за Вас е следната - първо хидратирайте кожата си с „Мисия 3‘, след пет минути  нанесете  „Мисия 1‘ и непосредствено след това е ред на ‚Мисия 2‘. Тази процедура се прилага два пъти на ден-  сутрин и вечер, най-добре след топъл душ и на чиста кожа. Разбира се това ще изисква търпение, но си заслужава резултата. „Мисия 3“ има за задача да витализира кожата ви и да остави маслата на другите две мисии да работят върху повърхността й. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 35:
                    text = "Здравейте, това е персоналната ни препоръка при ползване на трите Мисии.  Сухата кожа е епидермално жадна и за допълнителна хидратация първо използвайте „Мисия 3“. Ако ще използвате продуктите върху една и съща проблемна зона, схемата на нанасяне  за Вас е следната - първо хидратирайте кожата си с „Мисия 3‘, след пет минути  нанесете  „Мисия 1‘ и непосредствено след това е ред на ‚Мисия 2‘. Тази процедура се прилага три пъти на ден-  сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Разбира се това ще изисква търпение, но си заслужава резултата. „Мисия 3“ има за задача да витализира кожата ви и да остави маслата на другите две мисии да работят върху повърхността й. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 36:
                    text = "Здравейте, това е персоналната ни препоръка при ползване на трите Мисии.  Сухата кожа е епидермално жадна и за допълнителна хидратация първо използвайте „Мисия 3“. Ако ще използвате продуктите върху една и съща проблемна зона, схемата на нанасяне  за Вас е следната - първо хидратирайте кожата си с „Мисия 3‘, след пет минути  нанесете  „Мисия 1‘ и непосредствено след това е ред на ‚Мисия 2‘. Тази процедура се прилага три пъти на ден-  сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Разбира се това ще изисква търпение, но си заслужава резултата. „Мисия 3“ има за задача да витализира кожата ви и да остави маслата на другите две мисии да работят върху повърхността й. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 37:
                    text = "Здравейте, това е персоналната ни препоръка при ползване на трите Мисии. Дори и да сте с нормална кожа, е добре да правите  епидермална хидратация с „Мисия 3 - Хиалуронов Боди Коктейл“. Ако ще използвате продуктите върху една и съща проблемна зона, схемата на нанасяне  за Вас е следната - първо хидратирайте кожата си с „Мисия 3‘, след пет минути  нанесете  „Мисия 1‘ и непосредствено след това е ред на ‚Мисия 2‘. Тази процедура се прилага два пъти на ден-  сутрин и вечер, най-добре след топъл душ и на чиста кожа. Разбира се това ще изисква търпение, но си заслужава резултата. „Мисия 3“ има за задача да витализира кожата ви и да остави маслата на другите две мисии да работят върху повърхността й. Минималният препоръчителен период за терапията е 60 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 38:
                    text = "Здравейте, това е персоналната ни препоръка при ползване на трите Мисии. Дори и да сте с нормална кожа, е добре да правите  епидермална хидратация с „Мисия 3 - Хиалуронов Боди Коктейл“. Ако ще използвате продуктите върху една и съща проблемна зона, схемата на нанасяне  за Вас е следната - първо хидратирайте кожата си с „Мисия 3‘, след пет минути  нанесете  „Мисия 1‘ и непосредствено след това е ред на ‚Мисия 2‘. Тази процедура се прилага два пъти на ден-  сутрин и вечер, най-добре след топъл душ и на чиста кожа. Разбира се това ще изисква търпение, но си заслужава резултата. „Мисия 3“ има за задача да витализира кожата ви и да остави маслата на другите две мисии да работят върху повърхността й. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 39:
                    text = "Здравейте, това е персоналната ни препоръка при ползване на трите Мисии. Дори и да сте с нормална кожа, е добре да правите  епидермална хидратация с „Мисия 3 - Хиалуронов Боди Коктейл“. Ако ще използвате продуктите върху една и съща проблемна зона, схемата на нанасяне  за Вас е следната - първо хидратирайте кожата си с „Мисия 3‘, след пет минути  нанесете  „Мисия 1‘ и непосредствено след това е ред на ‚Мисия 2‘. Тази процедура се прилага три пъти на ден-  сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Разбира се това ще изисква търпение, но си заслужава резултата. „Мисия 3“ има за задача да витализира кожата ви и да остави маслата на другите две мисии да работят върху повърхността й. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 40:
                    text = "Здравейте, това е персоналната ни препоръка при ползване на трите Мисии. Дори и да сте с нормална кожа, е добре да правите  епидермална хидратация с „Мисия 3 - Хиалуронов Боди Коктейл“. Ако ще използвате продуктите върху една и съща проблемна зона, схемата на нанасяне  за Вас е следната - първо хидратирайте кожата си с „Мисия 3‘, след пет минути  нанесете  „Мисия 1‘ и непосредствено след това е ред на ‚Мисия 2‘. Тази процедура се прилага три пъти на ден-  сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Разбира се това ще изисква търпение, но си заслужава резултата. „Мисия 3“ има за задача да витализира кожата ви и да остави маслата на другите две мисии да работят върху повърхността й. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 41:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постигане на оптимални резултати. Нанасяйте „Мисия 1“  три пъти на ден на чиста кожа, която е задължително овлажнена, масажирайте до пълна абсорбация. Минималният препоръчителен период за терапията е 60 дни! Сухата кожа е епидермално жадна и продукта ще попие бързо, заради високото съдържание на вода в него, а с хидратацията ще успеете да оставите маслата на „Мисия 1“ да помогнат на проблемната кожа да се възстановява. Горещо препоръчваме за по -добро овлажняване да ползвате „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 42:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постигане на оптимални резултати. Нанасяйте „Мисия 1“  два пъти на ден, сутрин и вечер,  на чиста кожа, която е задължително овлажнена, масажирайте до пълна абсорбация. Минималният препоръчителен период за терапията е 60 дни! Сухата кожа е епидермално жадна и продукта ще попие бързо, заради високото съдържание на вода в него, а с хидратацията ще успеете да оставите маслата на „Мисия 1“ да помогнат на проблемната кожа да се възстановява. Горещо препоръчваме за по -добро овлажняване да ползвате „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 43:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постигане на оптимални резултати. Нанасяйте „Мисия 1“  три пъти на ден на чиста кожа, която е задължително овлажнена, масажирайте до пълна абсорбация. Минималният препоръчителен период за терапията е 90 дни! Сухата кожа е епидермално жадна и продукта ще попие бързо, заради високото съдържание на вода в него, а с хидратацията ще успеете да оставите маслата на „Мисия 1“ да помогнат на проблемната кожа да се възстановява. Горещо препоръчваме за по -добро овлажняване да ползвате „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“.Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 44:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постигане на оптимални резултати. Нанасяйте „Мисия 1“  три пъти на ден на чиста кожа, която е задължително овлажнена, масажирайте до пълна абсорбация. Минималният препоръчителен период за терапията е 90 дни! Сухата кожа е епидермално жадна и продукта ще попие бързо, заради високото съдържание на вода в него, а с хидратацията ще успеете да оставите маслата на „Мисия 1“ да помогнат на проблемната кожа да се възстановява. Горещо препоръчваме за по -добро овлажняване да ползвате „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“.Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 45:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постигане на оптимални резултати. Нанасяте „Мисия 1“ два пъти на ден, сутрин и вечер на чиста кожа до пълното и абсорбиране. Минималният препоръчителен период за терапията е 60 дни! Дори и да сте с нормална кожа, горещо Ви препоръчваме епидермална хидратация с „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 46:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постигане на оптимални резултати. Нанасяте „Мисия 1“ два пъти на ден, сутрин и вечер на чиста кожа до пълното и абсорбиране.  Минималният препоръчителен период за терапията е 60 дни! Дори и да сте с нормална кожа, горещо Ви препоръчваме епидермална хидратация с „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 47:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постигане на оптимални резултати. Нанасяте „Мисия 1“ три пъти на ден, сутрин, обед  и вечер на чиста кожа до пълното и абсорбиране. Минималният препоръчителен период за терапията е 90 дни! Дори и да сте с нормална кожа, горещо Ви препоръчваме епидермална хидратация с „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 48:
                    text = "Здравейте! Това е персоналната  ни препоръка към използването на продукта „Мисия 1“ за постигане на оптимални резултати. Нанасяте „Мисия 1“ три пъти на ден, сутрин, обед  и вечер на чиста кожа до пълното и абсорбиране. Минималният препоръчителен период за терапията е 90 дни!Дори и да сте с нормална кожа, горещо Ви препоръчваме епидермална хидратация с „Мисия 3 - Хиалуронов Боди Коктейл“, специално създаден за подпомагане на действието на „Мисия 1“. Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 49:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘“. Сухата кожа е епидермално жадна и за допълнителна хидратация първо използвайте „Мисия 3“ и пет  минути след това нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да регенерират и помогнат на кожата да се възстанови.  Тази процедура се прилага три пъти на ден-  сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 60 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 50:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘“. Сухата кожа е епидермално жадна и за допълнителна хидратация първо използвайте „Мисия 3“ и пет  минути след това нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да регенерират и помогнат на кожата да се възстанови.  Тази процедура се прилага два пъти на ден-  сутрин и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 60 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 51:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘“. Сухата кожа е епидермално жадна и за допълнителна хидратация първо използвайте „Мисия 3“ и пет  минути след това нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да регенерират и помогнат на кожата да се възстанови.  Тази процедура се прилага три пъти на ден-  сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 52:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘“. Сухата кожа е епидермално жадна и за допълнителна хидратация първо използвайте „Мисия 3“ и пет  минути след това нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да регенерират и помогнат на кожата да се възстанови.  Тази процедура се прилага три пъти на ден-  сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 53:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘. Дори и да  сте с нормална кожа, препоръчваме за допълнителна хидратация първо да използвате „Мисия 3“ и след пет минути да  нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да помогнат на кожата да се възстанови.  Тази процедура се прилага три пъти на ден- сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 60 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 54:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘. Дори и да  сте с нормална кожа, препоръчваме за допълнителна хидратация първо да използвате „Мисия 3“ и след пет минути да  нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да помогнат на кожата да се възстанови.  Тази процедура се прилага два пъти на ден- сутрин и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 60 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 55:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘. Дори и да  сте с нормална кожа, препоръчваме за допълнителна хидратация първо да използвате „Мисия 3“ и след пет минути да  нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да помогнат на кожата да се възстанови.  Тази процедура се прилага три пъти на ден- сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                case 56:
                    text = "Здравейте! Поздравления, че сте избрали оптималните продукти за борба със стриите: „Мисия 1“ и „Мисия 3‘. Дори и да  сте с нормална кожа, препоръчваме за допълнителна хидратация първо да използвате „Мисия 3“ и след пет минути да  нанесете „Мисия 1“.  Така маслата ще се задържат на повърхността и ще успеят да помогнат на кожата да се възстанови.  Тази процедура се прилага три пъти на ден- сутрин, обед и вечер, най-добре след топъл душ и на чиста кожа. Минималният препоръчителен период за терапията е 90 дни! Според вашите килограми, Вие трябва да приемате " + water + "мл. вода.";
                    break;
                default:
                    text = "Възникна грешка";
                    break;
            }
        }

        private void FindViews()
        {
            newMission = FindViewById<Button>(Resource.Id.nextSButton);
            textView = FindViewById<TextView>(Resource.Id.textCurrentMissionView);
            Typeface tf = Typeface.CreateFromAsset(Assets, "MinionPro-Regular.ttf");
            textView.SetTypeface(tf, TypefaceStyle.Normal);
            textView.Text = text;
        }

        private void HandleEvents()
        {
            newMission.Click += NewMissionButton_Click;
        }

        private void NewMissionButton_Click(object sender, EventArgs e)
        {
            var intent = new Intent(this, typeof(CurrentMissionActivity));
            StartActivity(intent);
            Finish();
        }

        private void LoadData()
        {
            lstSource = db.selectTableMission();
            mission = lstSource.First();
        }
    }
}